chat_system_835588637_actor_description=Master Trigius. Head of the Magic Academy.
chat_system_835588637_snap_0_question=^?^Welcome, [player]. Well, well - I've heard much about our new Royal Treasure Searcher. And everything I heard was good, I might add.<br>My name is Iron Trigius, but people call me Master Trigius or Professor. Besides my scientific magic research and lectures, I'm one of the Chairmen of the Magic Guild of Darion and Master of the Magic Academy.
chat_system_835588637_snap_0_answer_0=^?^Nice to meet you, Master Trigius.
chat_system_835588637_snap_1_question=^?^If you have any issues or questions, young man, you can always turn to me for help.
chat_system_835588637_snap_1_answer_0=^?^Sure. I will remember that, thank you.
chat_system_835588637_snap_1_header_0=^?^So why have you come to the Magic Academy? Do you have business here, or is it just your curiosity?
chat_system_835588637_snap_2_question=^?^I greet you once again, [player]. What can I do for you?
chat_system_835588637_snap_2_answer_0=^?^I'd like to pass the test of the Judgment Day Arena! 
chat_system_835588637_snap_2_answer_1=^?^I came by order of His Majesty. I am to collect some artifact from you.
chat_system_835588637_snap_2_answer_2=^?^I was sent by Commander Nerold. I passed the test on the Magic Range. Nerold gave me this document and sent me here to claim my reward. 
chat_system_835588637_snap_2_answer_3=^?^I would like to buy something from you.
chat_system_835588637_snap_2_answer_4=^?^I have some questions for you, Professor. 
chat_system_835588637_snap_2_answer_5=^?^I think I have something you can help me with. You see, I have an old map of Endoria that was drawn up by King Fandor himself. 
chat_system_835588637_snap_2_answer_6=^?^I'm looking for a job. Maybe you have something for me?
chat_system_835588637_snap_2_answer_7=^?^I've found a strange scroll. Can you help me to discover what that is?
chat_system_835588637_snap_2_answer_8=^?^Remember, I brought you a design for the creation of the sandals "Wings of Wind"? 
chat_system_835588637_snap_2_answer_9=^?^I'd like you to make some Scaly Armor for me. 
chat_system_835588637_snap_2_answer_10=^?^I don't remember if you made a Silver sword, the design of which I had brought you.
chat_system_835588637_snap_2_answer_11=^?^I have to go, goodbye!
chat_system_835588637_snap_21_question=^?^You have passed the Magic Range? That's interesting... And how did you manage it?<br>Anyway, accept my congratulations, this is a difficult test and not everyone can pass it.<br>Your reward is a Magic Staff that increases Intellect.
chat_system_835588637_snap_21_answer_0=^?^Thank you, Master.
chat_system_835588637_snap_question_question=^?^Yes, I'll listen to you carefully. What do you want to know?
chat_system_835588637_snap_question_answer_0=^?^Tell me about magic. Imagine that I'm a novice-student.
chat_system_835588637_snap_question_header_0=^?^Magic is the special art of casting spells. The whole world is saturated with special ether that is called Mana. It is used by mages to make magic.<br>A spell is a specific combination of words, gestures and thoughts that help to change the world by the power of thought. The stronger the mage and more magic ether he has, the stronger the effect of his spell will be.<br>Here in the Academy we not only study the laws of magic, and explore working principles of spells, but we try to develop new spells.<br>A person can make magic in two different ways:<br>By using formulas and Mana contained in scrolls, during which process the scroll is destroyed.<br>By using one's own power and directing spells by force of will. To do this one must know the spell formula very well by learning it by heart from the scroll.<br>We do not study wonders of Divine origin or ritual magic here in the Academy. To ask superior powers - like Gods or Titans - for help is indeed beneath a true mage's dignity. That is instead for priests and primitive shamans.
chat_system_835588637_snap_question_answer_1=^?^Have you ever heard the name of General Karador? 
chat_system_835588637_snap_question_answer_2=^?^King Kerus? Was he a mage? 
chat_system_835588637_snap_question_header_2=^?^You want to know about Kerus? He ruled the independent kingdom Heon, a mages country where wizards were elite and ruled all affairs of the country, and the art of magic was honored and developed in all ways conceivable.<br>Kerus was the descendant of the Leonard dynasty, and when Kerus, leading a small troop of battle mages and knights, managed to stop the Demon invasion into our world, he was elected to be the king of Darion.<br>He was truly a great man and a great mage, who managed to unite the fragmented kingdoms into one great power. It was he who founded the Academy, and here are kept a great many of the artifacts taken from the Demon's world by Kerus Leonard's army. A great mage, a talented commander, and provident king, whose rule opened the beginning of the Golden Age in Darion history.
chat_system_835588637_snap_question_answer_3=^?^Tell me about the Academy. 
chat_system_835588637_snap_question_header_3=^?^The Academy was founded by King Kerus just as he mounted the throne. The best Archmages from Heon, the mages kingdom, were invited by His Majesty to teach the wizards here and perform magic research.<br>The Academy is the center of the magical arts in Darion. Here we explore and create spells and living artifacts. We teach mages of different spheres - from weather mages to the powerful battle mages and elemental mages.
chat_system_835588637_snap_question_answer_4=^?^I'd like to know about how to upgrade items.
chat_system_835588637_snap_question_answer_5=^?^I'd like to know more about living items.
chat_system_835588637_snap_question_header_5=^?^Living items are special kinds of artifacts created by magic. These items have Soul Crystals inside them. In these Crystals we put a real living soul, though it is not a natural soul like yours and mine - it is created by magic.<br>These artifacts can think. They even have their own personalities. If one of those artifacts doesn't like something, it can rebel against its owner. But if you manage to win its favor, the artifact will show its special properties.
chat_system_835588637_snap_question_answer_6=^?^Also... Could you tell me about the Death Magic Department and Necromancers? 
chat_system_835588637_snap_question_answer_7=^?^I'd like to know more about necromancy.
chat_system_835588637_snap_question_header_7=^?^You ask strange questions, young man. I hope you know that necromancy has been illegal since King Larg? At that time our Death Magic Department in the Academy was closed. Perhaps this prohibition later caused the necromancers' revolt and the crusades.
chat_system_835588637_snap_question_answer_8=^?^I have no more questions for you. See you later.
chat_system_835588637_snap_23_question=^?^Karador - that was the name of one of the greatest, or maybe even the very greatest general in the whole history of Darion. Being a great strategist and tactician, and both a skilled warrior and born leader, he managed to succeed at a very early age.<br>Unfortunately, after his family was killed by necromancers, the young general became obsessed with thoughts of revenge. And he saw to it that everyone who had been captured on suspicion of cooperation with necromancers or orcs was subjected to unthinkable torture.<br>His Majesty Vilor Eliar ordered to execute the general for his cruel treatment of captives and the deaths of innocents.
chat_system_835588637_snap_23_answer_0=^?^I heard that he is back. He's back as a powerful mage with a huge army of undead creatures. The necromancers serve him.
chat_system_835588637_snap_23_header_0=^?^It's clearly impossible. He was executed and buried somewhere in Marshan Swamp. Even if someone stole the body, they would require divine interference to resurrect him and give him the power you are describing. Even the powers of King Vilor had their price - and a high one it was.<br>Besides, Karador hates everything connected with necromancers and Death magic. After all, he went insane because everyone he loved died at the hands of the necromancers, during their revolt. I would not put any stock in these rumors.
chat_system_835588637_snap_25_question=^?^Hm. It's a good question. As I understand it, you are talking about "living" items created by magic and containing a soul in them, right?<br>These objects have a lot of hidden features, and often serve their new master unwillingly. Some such items can even pretend to be a useless, inanimate thing. I used to know a sword that could turn into a useless piece of steel if it didn't like the master.
chat_system_835588637_snap_25_answer_0=^?^A sword that turns into a piece of steel? Incredible!
chat_system_835588637_snap_26_question=^?^There is no such word in magic language, for we know that anything is possible.<br>So don't be surprised if you suddenly find in your bag a silver shining blade instead of a rusty sword, or vice versa - or if your shield breaks into pieces in your arms.<br>This would mean that you have not an ordinary object but a "living" one. And it has decided that you do not suit it as its master and the item refuses to serve you. Or on the contrary, it particularly likes you for some reason. Then this item tries to win your favor, by showing you its special properties.
chat_system_835588637_snap_26_answer_0=^?^And how can I win the respect of such an item?
chat_system_835588637_snap_27_question=^?^The best way is to understand the essence of an item, its desires and its fate. If an item was created to kill dragons, then each dragon you kill will incline the item towards you further. And also be aware of who has created an item. An artifact of the elves does not like it when the sharp-eared are dying in great numbers nearby, and necromancer items cannot tolerate the company of elves.
chat_system_835588637_snap_27_answer_0=^?^Is there another way to upgrade an item? 
chat_system_835588637_snap_27_header_0=^?^Of course there is. A living item can be subdued by force. An item will resist and try to stop you by force, and will protect itself with its keepers.<br>Have you ever heard of gremlins? Those evil creatures who like to settle in dwarven mechanisms and destroy them? I don't know whether keepers look like gremlins because they are descendants of a species of gremlin-mages - or perhaps Gremlins are descendants of keepers - but in any case, you can recognize the likeness at once. Of course - if you have ever run into a gremlin.<br>Some mages believe that keepers are real gremlin-mages and if they don't want to let an item show its real force, they warp its magical structure.
chat_system_835588637_snap_22_question=^?^In the times when there was no Darion Academy, in the Magic Guild of Heon, in the mages' kingdom, the Death Department was created. Masters of the Department studied the dark side of Titan's magic - necromancy. You probably know that the magical laws of our world were created by gods. But besides the gods' magic there was some contribution to magic from Titans. For example, the magic of shamans appeals to magical forces of the Titans. And the most incredible feat which the Titans managed - they could go beyond the laws of life and death created by the gods. In some unimaginable way, Titans managed to create some dark art that allowed them to cross the border of life and death - in both directions. Resurrect a dead body, speak to ghosts of dead people, turn a living body into a decomposed one or kill a living creature instantaneously - necromancers can do all of this and more.<br>Necromancy is believed to be the last drop that made the cup of divine patience overflow, and in their anger, the gods destroyed every last one of the Titans.
chat_system_835588637_snap_22_answer_0=^?^And why was the Death Department closed?
chat_system_835588637_snap_22_header_0=^?^Fear. Fear of the unknown, and fear of the natural force and power of the dark arts. Necromancers call that time the Exodus.<br>During the time of war with the elves, the necromancers offered their help to their King, Larg Leonard. They raised a huge army of undead creatures, and led it through the Land of Death right into Ellinia, the heart of the elven forest. Having seen what had come to their forests; elves surrendered without a struggle.<br>This display of power was so terrifying to His Majesty, Larg Leonard, that he had issued a decree of necromancy prohibition, and all its adherents were expelled from Darion.
chat_system_835588637_snap_22_answer_1=^?^The necromancers' revolt, and the Inquisition? Tell me more about it...
chat_system_835588637_snap_22_header_1=^?^To clear Darion lands from the defilement of the Death Magic, the crown organized the Inquisition. It was like an order, an organization of battle priests and mages, who were charged with finding and destroying the rest of the necromancers who didn't want to leave Darion.<br>The necromancers who were expelled by King Larg's decree found a shelter in the Land of Death, where they then planned revenge for a long time. And then they returned. First it was a plague, then the invasion of numerous legions of undead creatures led by necromancers. This period was known as the necromancers' revolt - that's what our historians call the long-term war that broke out.
chat_system_835588637_snap_22_answer_2=^?^I see, I have no questions.
chat_system_835588637_snap_24_question=^?^The map of Fandor? The Legendary map. Sell it to us! We will give you three scrolls from each of the schools of magic!
chat_system_835588637_snap_24_answer_0=^?^Ok, I agree, take it.
chat_system_835588637_snap_24_answer_1=^?^I think I should talk to King Mark first.
chat_system_835588637_snap_3_question=^?^The Scroll? I'm ready to buy it for 1,500 Gold.
chat_system_835588637_snap_3_answer_0=^?^Of course I agree. Take it.
chat_system_835588637_snap_8_question=^?^Can I help you with something else?
chat_system_835588637_snap_8_answer_0=^?^Yes. For what purpose do you need this recipe, I wonder?
chat_system_835588637_snap_4_question=^?^Well...<br>"Magic instructions for the creation of Scaly Armor.<br>This armor is usually made of hard scaly plates that are left when a dragon molts.<br>It can also be made by magic, but to do it you should be a mage of at least level 25, also you need the scales of horned fish - 5000 pieces, magic spheres - 3 pieces, one magic anvil, two clots of jellopy"... Well, the rest you wouldn't understand.
chat_system_835588637_snap_4_answer_0=^?^Could you do it for me?
chat_system_835588637_snap_10_question=^?^Yes, sure. We have all the ingredients. But to make a set of Scaly Armor would require: 500 Gold, 2 Might Runes, and 2 Magic Crystals.<br>Are you still interested?
chat_system_835588637_snap_10_answer_0=^?^Yes, sure.
chat_system_835588637_snap_10_answer_1=^?^Well, I don't need the Armor at the moment. But as soon as I need it I will come to you.
chat_system_835588637_snap_11_question=^?^Then check if you have all the necessary items. 
chat_system_835588637_snap_11_answer_0=^?^Yes, I have.
chat_system_835588637_snap_11_answer_1=^?^No, not yet.
chat_system_835588637_snap_14_question=^?^It's done.
chat_system_835588637_snap_14_answer_0=^?^Thank you.
chat_system_835588637_snap_15_question=^?^Well, "no" means... "no." Maybe next time you will have all the necessary components.
chat_system_835588637_snap_15_answer_0=^?^Ok, I'll try to collect all the components.
chat_system_835588637_snap_5_question=^?^A magical design! Wonderful! I can offer you 4000 Gold.
chat_system_835588637_snap_5_answer_0=^?^Take it, take it.
chat_system_835588637_snap_7_question=^?^Do you want to know something else?
chat_system_835588637_snap_7_answer_0=^?^Yes. Can you read what was in the recipe?
chat_system_835588637_snap_12_question=^?^Well, I will not read the whole recipe. There is a lot of information you shouldn't hear.<br>But we can make a Silver Rapier for you according to this recipe. The Rapier increases Attack against undead creatures by 30%.<br>For it we require: 2000 Gold, 5 Mind Runes, and 5 Magic Crystals. <br>Do you agree?
chat_system_835588637_snap_12_answer_0=^?^Yes, of course I agree. Let me check if I have everything for it.
chat_system_835588637_snap_12_answer_1=^?^No, not now. But I will think over your offer.
chat_system_835588637_snap_13_question=^?^Well? Are we going to create it?
chat_system_835588637_snap_13_answer_0=^?^Yes, I have all the ingredients.
chat_system_835588637_snap_13_answer_1=^?^No, unfortunately I don't have enough money.
chat_system_835588637_snap_18_question=^?^Wonderful! And meanwhile we will check if the recipe is correct. Ah yes, it works. Here, take your rapier.
chat_system_835588637_snap_18_answer_0=^?^Thank you very much.
chat_system_835588637_snap_6_question=^?^Design? Wonderful news! We always need them. Well, well. This is a very good recipe and it is highly valuable. I can offer you 8000 gold for it.
chat_system_835588637_snap_6_answer_0=^?^Excellent! Take it.
chat_system_835588637_snap_9_question=^?^Do you want me to read what this design is?
chat_system_835588637_snap_9_answer_0=^?^Sure!
chat_system_835588637_snap_16_question=^?^You know - that's a very good design. You can make the "Wings of Wind" - sandals that give +1 Speed to all flying and soaring warriors. It is a very rare and very useful item.
chat_system_835588637_snap_16_answer_0=^?^That's very interesting.
chat_system_835588637_snap_17_question=^?^You need a lot of precious ingredients for it. But we have all of them at our storehouse. From you, if you want us to make the sandals, we would require: ten thousand gold, 10 Magic Runes, and 10 Magic Crystals. Well, do you want them?
chat_system_835588637_snap_17_answer_0=^?^Yes. I have everything to buy it.
chat_system_835588637_snap_17_answer_1=^?^Of course I'd like to, but unfortunately, I don't have everything you want me to give you.
chat_system_835588637_snap_17_answer_2=^?^Right now I'd like to spend my Runes for something else. But as soon as I have extra ingredients I'll be back.
chat_system_835588637_snap_19_question=^?^Wait a moment... The sandals are a difficult item, and to create it we need to be very accurate.<br>Ok, it's done. Here you are.
chat_system_835588637_snap_19_answer_0=^?^Thank you. Hope these sandals will bring me luck.
chat_system_835588637_switch_2_header_0=^?^Of course I remember. But you didn't have anything to pay for our work. Do you have everything now?<br>We need: ten thousand gold, 10 Magic Runes, and 10 Magic Crystals.
chat_system_835588637_switch_4_header_0=^?^Of course. I don't mind. Do you have: 500 Gold, 2 Might Runes, and 2 Magic Crystals? 
chat_system_835588637_switch_3_header_0=^?^No, I do not. Do you have everything? We need: 2000 Gold, 2 Mind Runes, and 5 Magic Crystals.
